NordicPlayground/nRF51-ble-bcast-mesh/SDK/app_timer.c
/**@brief Structure describing a timer operation. */
typedef struct
{
    timer_user_op_type_t op_type;                                           /**< Timer operation type. */
    app_timer_id_t       timer_id;                                          /**< Id of timer on which the operation is to be performed. */
    union
    {
        timer_user_op_start_t start;                                        /**< Structure describing a timer start operation. */
    } params;
} timer_user_op_t;

STATIC_ASSERT(sizeof(timer_user_op_t) <= APP_TIMER_USER_OP_SIZE);
STATIC_ASSERT(sizeof(timer_user_op_t) % 4 == 0);

/**@brief Structure describing a timer user.
 *
 * @details For each user of the timer module, there will be a timer operations queue. This queue
 *          will hold timer operations issued by this user until the timer interrupt handler
 *          processes these operations. For the current implementation, there will be one user for
 *          each interrupt level available to the application (APP_HIGH, APP_LOW and THREAD_MODE),
 *          but the module can easily be modified to e.g. have one queue per process when using an
 *          RTOS. The purpose of the queues is to be able to have a completely lockless timer
 *          implementation.
 */
typedef struct
{
    uint8_t           first;                                                    /**< Index of first entry to have been inserted in the queue (i.e. the next entry to be executed). */
    uint8_t           last;                                                     /**< Index of last entry to have been inserted in the queue. */
    uint8_t           user_op_queue_size;                                       /**< Queue size. */
    timer_user_op_t * p_user_op_queue;                                          /**< Queue buffer. */
} timer_user_t;

STATIC_ASSERT(sizeof(timer_user_t) == APP_TIMER_USER_SIZE);
STATIC_ASSERT(sizeof(timer_user_t) % 4 == 0);

/**@brief User id type.
 *
 * @details In the current implementation, this will automatically be generated from the current
 *          interrupt level.
 */
typedef uint32_t timer_user_id_t;

#define TIMER_NULL                  ((app_timer_id_t)(0 - 1))                   /**< Invalid timer id. */
#define CONTEXT_QUEUE_SIZE_MAX      (2)                                         /**< Timer internal elapsed ticks queue size. */

static uint8_t                       m_node_array_size;                         /**< Size of timer node array. */
static timer_node_t *                mp_nodes = NULL;                           /**< Array of timer nodes. */
static uint8_t                       m_user_array_size;                         /**< Size of timer user array. */
static timer_user_t *                mp_users;                                  /**< Array of timer users. */
static app_timer_id_t                m_timer_id_head;                           /**< First timer in list of running timers. */
static uint32_t                      m_ticks_latest;                            /**< Last known RTC counter value. */
static uint32_t                      m_ticks_elapsed[CONTEXT_QUEUE_SIZE_MAX];   /**< Timer internal elapsed ticks queue. */
static uint8_t                       m_ticks_elapsed_q_read_ind;                /**< Timer internal elapsed ticks queue read index. */
static uint8_t                       m_ticks_elapsed_q_write_ind;               /**< Timer internal elapsed ticks queue write index. */
static app_timer_evt_schedule_func_t m_evt_schedule_func;                       /**< Pointer to function for propagating timeout events to the scheduler. */
static bool                          m_rtc1_running;                            /**< Boolean indicating if RTC1 is running. */


/**@brief Function for initializing the RTC1 counter.
 *
 * @param[in] prescaler   Value of the RTC1 PRESCALER register. Set to 0 for no prescaling.
 */
static void rtc1_init(uint32_t prescaler)
{
    NRF_RTC1->PRESCALER = prescaler;
    NVIC_SetPriority(RTC1_IRQn, RTC1_IRQ_PRI);
}


/**@brief Function for starting the RTC1 timer.
 */
static void rtc1_start(void)
{
    NRF_RTC1->EVTENSET = RTC_EVTEN_COMPARE0_Msk;
    NRF_RTC1->INTENSET = RTC_INTENSET_COMPARE0_Msk;

    NVIC_ClearPendingIRQ(RTC1_IRQn);
    NVIC_EnableIRQ(RTC1_IRQn);

    NRF_RTC1->TASKS_START = 1;
    nrf_delay_us(MAX_RTC_TASKS_DELAY);

    m_rtc1_running = true;
}


/**@brief Function for stopping the RTC1 timer.
 */
static void rtc1_stop(void)
{
    NVIC_DisableIRQ(RTC1_IRQn);

    NRF_RTC1->EVTENCLR = RTC_EVTEN_COMPARE0_Msk;
    NRF_RTC1->INTENCLR = RTC_INTENSET_COMPARE0_Msk;

    NRF_RTC1->TASKS_STOP = 1;
    nrf_delay_us(MAX_RTC_TASKS_DELAY);

    NRF_RTC1->TASKS_CLEAR = 1;
    m_ticks_latest        = 0;
    nrf_delay_us(MAX_RTC_TASKS_DELAY);

    m_rtc1_running = false;
}


/**@brief Function for returning the current value of the RTC1 counter.
 *
 * @return     Current value of the RTC1 counter.
 */
static __INLINE uint32_t rtc1_counter_get(void)
{
    return NRF_RTC1->COUNTER;
}


/**@brief Function for computing the difference between two RTC1 counter values.
 *
 * @return     Number of ticks elapsed from ticks_old to ticks_now.
 */
static __INLINE uint32_t ticks_diff_get(uint32_t ticks_now, uint32_t ticks_old)
{
    return ((ticks_now - ticks_old) & MAX_RTC_COUNTER_VAL);
}


/**@brief Function for setting the RTC1 Capture Compare register 0, and enabling the corresponding
 *        event.
 *
 * @param[in] value   New value of Capture Compare register 0.
 */
static __INLINE void rtc1_compare0_set(uint32_t value)
{
    NRF_RTC1->CC[0] = value;
}


/**@brief Function for inserting a timer in the timer list.
 *
 * @param[in]  timer_id   Id of timer to insert.
 */
static void timer_list_insert(app_timer_id_t timer_id)
{
    timer_node_t * p_timer = &mp_nodes[timer_id];
    
    if (m_timer_id_head == TIMER_NULL)
    {
        m_timer_id_head = timer_id;
    }
    else
    {
        if (p_timer->ticks_to_expire <= mp_nodes[m_timer_id_head].ticks_to_expire)
        {
            mp_nodes[m_timer_id_head].ticks_to_expire -= p_timer->ticks_to_expire;
            
            p_timer->next   = m_timer_id_head;
            m_timer_id_head = timer_id;
        }
        else
        {
            app_timer_id_t previous;
            app_timer_id_t current;
            uint32_t       ticks_to_expire;

            ticks_to_expire = p_timer->ticks_to_expire;
            previous        = m_timer_id_head;
            current         = m_timer_id_head;
            
            while ((current != TIMER_NULL) && (ticks_to_expire > mp_nodes[current].ticks_to_expire))
            {
                ticks_to_expire -= mp_nodes[current].ticks_to_expire;
                previous         = current;
                current          = mp_nodes[current].next;
            }

            if (current != TIMER_NULL)
            {
                mp_nodes[current].ticks_to_expire -= ticks_to_expire;
            }

            p_timer->ticks_to_expire = ticks_to_expire;
            p_timer->next            = current;
            mp_nodes[previous].next  = timer_id;
        }
    }
}


/**@brief Function for removing a timer from the timer queue.
 *
 * @param[in]  timer_id   Id of timer to remove.
 */
static void timer_list_remove(app_timer_id_t timer_id)
{
    app_timer_id_t previous;
    app_timer_id_t current;
    uint32_t       timeout;

